/*copy from
 http://www.cyberforum.ru/java-j2se/thread1257076.html */
 /*Написать программу для поиска слова в файле, программа должна показать: количество таких слов в файле, для каждого найденного слова: номер строки, и номер слова в строке. Искомое слово вводим с клавиатуры.
Я так думал что нужно сначала весь текст файла записать в ArrayList, но у меня не получается сделать поиск по файлу и вывести номер строки и номер слова в строке.*/
// question
public static void main(String[] args) throws IOException{
        FileReader fr = new FileReader("slovar");
        Scanner scan= new Scanner(fr);
        Scanner sc = new Scanner(System.in);
        String word = sc.nextLine();
        read("slovar");
        fillArray("slovar",word);
    }
    public static String read(String s) throws IOException{
        FileReader fr = new FileReader("slovar");
        Scanner scan= new Scanner(fr);  
        while(scan.hasNext()){
        System.out.println(scan.nextLine());
        }
        return s;
    }
    public static ArrayList<String> fillArray(String s,String word) throws IOException{
        ArrayList<String> list = new ArrayList();
        FileReader fr = new FileReader("slovar");
        Scanner scan= new Scanner(fr);
        while(scan.hasNext()){          
                list.add(scan.next());                      
        }
        System.out.println(list);       
        return list;
    }

// asked
public static void main(String[] args) throws FileNotFoundException, IOException {
        String searchWord = "ходил"; // слово заменить на нужное
        FileInputStream fis = new FileInputStream(new File("E:/1.txt")); // путь заменить на нужный
        byte[] content = new byte[fis.available()];
        fis.read(content);
        fis.close();
        String[] lines = new String(content, "Cp1251").split("\n"); // кодировку указать нужную
        int i = 1;
        for (String line : lines) {
            String[] words = line.split(" ");
            int j = 1;
            for (String word : words) {
                if (word.equalsIgnoreCase(searchWord)) {
                    System.out.println("Найдено в " + i + "-й строке, " + j + "-е слово");
                }
                j++;
            }
            i++;
        }
    }